; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v9 ?v12)
             (pred_4 ?v2 ?v13)
             (pred_10 ?v9 ?v13)
             (pred_12 ?v3 ?v9 )
	     (pred_3 ?v9)
             (pred_6 ?v7)
             (pred_11 ?v2)
             (pred_7 ?v13)
             (pred_9 ?v9)
             (pred_1 ?v2)
             (pred_2 ?v9)
             (pred_8 ))



(:action op_3
:parameters (?v4 ?v6 ?v11 ?v8)
:precondition (and (pred_6 ?v4) (pred_6 ?v6) (pred_11 ?v11) (pred_7 ?v8)
          (pred_5 ?v4 ?v6) (pred_4 ?v11 ?v8)
                   (pred_10 ?v6 ?v8) (pred_3 ?v4) 
                   (pred_9 ?v6) (pred_1 ?v11))
:effect (and  (pred_2 ?v6) (not (pred_9 ?v6))))


(:action op_5
:parameters (?v4 ?v10)
:precondition (and (pred_6 ?v4) (pred_6 ?v10)
               (pred_3 ?v4) (pred_5 ?v4 ?v10) (pred_2 ?v10))
:effect (and (pred_3 ?v10) (not (pred_3 ?v4))))

(:action op_2
:parameters (?v4 ?v11)
:precondition (and (pred_6 ?v4) (pred_11 ?v11) 
                  (pred_3 ?v4) (pred_12 ?v11 ?v4) (pred_8 ))
:effect (and (pred_1 ?v11)
   (not (pred_12 ?v11 ?v4)) (not (pred_8 ))))


(:action op_1
:parameters (?v4 ?v5 ?v1)
:precondition (and (pred_6 ?v4) (pred_11 ?v5) (pred_11 ?v1)
                  (pred_3 ?v4) (pred_1 ?v1) (pred_12 ?v5 ?v4))
:effect (and (pred_1 ?v5) (pred_12 ?v1 ?v4)
        (not (pred_1 ?v1)) (not (pred_12 ?v5 ?v4))))

(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_6 ?v4) (pred_11 ?v11) 
                  (pred_3 ?v4) (pred_1 ?v11))
:effect (and (pred_8 ) (pred_12 ?v11 ?v4) (not (pred_1 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_09 obj_13 obj_17 obj_08 obj_14 obj_04 obj_20 obj_16 obj_18 obj_03 obj_10 obj_19 obj_06 obj_05 obj_12
    obj_07 obj_15
    obj_11 obj_02
    )

    (:init
       (pred_8)

       (pred_6 obj_01)
       (pred_6 obj_09)
       (pred_6 obj_13)
       (pred_6 obj_17)
       (pred_6 obj_08)
       (pred_6 obj_14)
       (pred_6 obj_04)
       (pred_6 obj_20)
       (pred_6 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_03)
       (pred_6 obj_10)
       (pred_6 obj_19)
       (pred_6 obj_06)
       (pred_6 obj_05)
       (pred_6 obj_12)
       (pred_7 obj_07)
       (pred_7 obj_15)
       (pred_11 obj_11)
       (pred_11 obj_02)

       (pred_5 obj_01 obj_08)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_09 obj_13)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_13 obj_17)
       (pred_5 obj_13 obj_09)
       (pred_5 obj_17 obj_20)
       (pred_5 obj_17 obj_13)
       (pred_5 obj_08 obj_16)
       (pred_5 obj_08 obj_14)
       (pred_5 obj_08 obj_01)
       (pred_5 obj_14 obj_18)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_04 obj_03)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_20 obj_10)
       (pred_5 obj_20 obj_17)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_16 obj_18)
       (pred_5 obj_16 obj_08)
       (pred_5 obj_18 obj_06)
       (pred_5 obj_18 obj_03)
       (pred_5 obj_18 obj_14)
       (pred_5 obj_18 obj_16)
       (pred_5 obj_03 obj_05)
       (pred_5 obj_03 obj_10)
       (pred_5 obj_03 obj_04)
       (pred_5 obj_03 obj_18)
       (pred_5 obj_10 obj_12)
       (pred_5 obj_10 obj_20)
       (pred_5 obj_10 obj_03)
       (pred_5 obj_19 obj_06)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_06 obj_05)
       (pred_5 obj_06 obj_18)
       (pred_5 obj_06 obj_19)
       (pred_5 obj_05 obj_12)
       (pred_5 obj_05 obj_03)
       (pred_5 obj_05 obj_06)
       (pred_5 obj_12 obj_10)
       (pred_5 obj_12 obj_05)
       (pred_9 obj_03)
       (pred_9 obj_13)
       (pred_10  obj_03 obj_07)
       (pred_10  obj_13 obj_15)
       (pred_2 obj_01)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_08)
       (pred_2 obj_14)
       (pred_2 obj_04)
       (pred_2 obj_20)
       (pred_2 obj_16)
       (pred_2 obj_18)
       (pred_2 obj_10)
       (pred_2 obj_19)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_12)

       (pred_4  obj_11 obj_07)
       (pred_4  obj_02 obj_15)
       (pred_12 obj_11 obj_05)
       (pred_12 obj_02 obj_01)
       (pred_3 obj_16)
    )

    (:goal (and
       (pred_12 obj_11 obj_09)
    ))
(:constraints
  (always (not (pred_3 obj_18)))
)
)

; plan
1. (op_5 obj_16 obj_19)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_19)
   goals met: 0 of 1
2. (op_5 obj_19 obj_06)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_06)
   goals met: 0 of 1
3. (op_5 obj_06 obj_05)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_05)
   goals met: 0 of 1
4. (op_2 obj_05 obj_11)
   deleted: (pred_12 obj_11 obj_05) (pred_8)
   added: (pred_1 obj_11)
   goals met: 0 of 1
5. (op_3 obj_05 obj_03 obj_11 obj_07)
   deleted: (pred_9 obj_03)
   added: (pred_2 obj_03)
   goals met: 0 of 1
6. (op_5 obj_05 obj_03)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_03)
   goals met: 0 of 1
7. (op_5 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_04)
   goals met: 0 of 1
8. (op_5 obj_04 obj_14)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_14)
   goals met: 0 of 1
9. (op_5 obj_14 obj_09)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_09)
   goals met: 0 of 1
10. (op_4 obj_09 obj_11)
   deleted: (pred_1 obj_11)
   added: (pred_8) (pred_12 obj_11 obj_09)
   goals met: 1 of 1
